package pm;

public class Exam10 {
    public static void main(String[] args) {
        /* 매서드는 클래스의 기능에 해당하는 요소
        * 먹기, 잠자기, 공부하기, 전진하기, 후진하기 ... 

        * public static int sum(int a, int b){
        * public : 접근제어자 static : 객체가 생성이 되지 않고도 쓸 수 있게끔 해주는 것
        * int : return 타입 (int a, int b) : 파라미터  
        * }

        * 매서드명은 관례적으로 소문자로 작성하고 소괄호 안에는 입력 매개변수로
        * 매서드를 호출할 때 전달되는 값의 자료형과 저장할 지역 변수명을 정의함
        * > 입력되는 값으로 int형 2개를 입력받아 처리하는 매서드임
        * 출력되는 결과, 즉 리턴 값의 자료형은 int이고 접근은 public으로 선언되어있음

        * 매서드 호출
        * 매서드도 클래스의 멤버이므로 객체 안에 존재함
        * 클래스 외부에서 매서드를 사용하려면 객체를 먼저 생성해야 함
        * 클래스 내부에 있는 매서드끼리는 객체를 생성하지 않고 서로를 호출할 수 있음

        * 매서드 오버로딩
        * 매개변수의 갯수와 매개변수의 자료형에 따라 각기 다른 매서드가 실행되는 것을 의미함
        * print();  print(3);   print(5.89);    print(2,4);
        * 4개의 print() 매서드가 오버로딩, 각각읜 다른 매개변수의 개수 또는 타입에 따라
        * 다른 각각의 매서드가 실행됨
        
        */
    }
}

class B{
    /* 1. 인풋 아웃풋 전부 다 존재

    * 2. 인풋 아웃풋 전부 없는
    * void noinnoout() {System.out.println("호출이 되었습니다");}
    * 부르기만 하면 작동하게 하는 것

    * 3. 인풋만 있는 

    * 4. 아웃풋만 있는
    */
}